In [1]:
import numpy as np
import pandas as pd

In [19]:
#데이타 프레임 참조하기 1
dic = {'names':['가길동','나길동','다길동','라길동'],'scores':[90,56,87,78],'grade':['A','F','B','C']}
df = pd.DataFrame(dic,index=[1,2,3,4])
df

  names  scores grade
1   가길동      90     A
2   나길동      56     F
3   다길동      87     B
4   라길동      78     C

In [20]:
#head(n)함수:앞에서부터 디폴트로 5개의 데이타를 반환. 숫자(n)를 지정 가능
df.head(2)

  names  scores grade
1   가길동      90     A
2   나길동      56     F

In [21]:
#tail(n)함수:뒤에서부터 디폴트로 5개의 데이타를 반환. 숫자(n)를 지정 가능
df.tail(2)

  names  scores grade
3   다길동      87     B
4   라길동      78     C

In [22]:
#sample(n)함수:랜덤하게 디폴트로 1개의 데이타를 반환. 숫자(n)를 지정 가능
df.sample()

  names  scores grade
2   나길동      56     F

In [23]:
#describe()함수:기술 통계를 생성.숫자 데이터 분포의 중심 경향, 분산 및 모양을 요약하는 통계치 반환
df.describe()#scores컬럼이 수치 데이타 임으로

          scores
count   4.000000
mean   77.750000
std    15.370426
min    56.000000
25%    72.500000
50%    82.500000
75%    87.750000
max    90.000000

In [24]:
#info()함수
#컬럼 인덱스 dtype 및 null이 아닌 값 및 메모리 사용량을 포함하는 DataFrame에 대한 정보를 출력
#결측치 존재 유무 판단할때 주로 사용한다
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   4 non-null      object
 1   scores  4 non-null      int64
 2   grade   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [25]:
df2 = pd.DataFrame(dic,columns=['names','years','scores','grade','major'],index=list('가나다라'))
df2

  names years  scores grade major
가   가길동   NaN      90     A   NaN
나   나길동   NaN      56     F   NaN
다   다길동   NaN      87     B   NaN
라   라길동   NaN      78     C   NaN

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 가 to 라
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   4 non-null      object
 1   years   0 non-null      object
 2   scores  4 non-null      int64
 3   grade   4 non-null      object
 4   major   0 non-null      object
dtypes: int64(1), object(4)
memory usage: 192.0+ bytes

In [ ]:
#하나의 컬럼 참조하기
#데이타프레임객체["컬럼명"] 혹은 데이타프레임객체.컬럼명 : 시리즈로 가져온다

In [37]:
#df2['scores']
df2.scores

가    90
나    56
다    87
라    78
Name: scores, dtype: int64

In [36]:
#두개 이상의 컬럼 참조하기:데이타 프레임으로 가져온다
#df2['namses','scores']##KeyError: ('names', 'score')
df2[['names','scores']]

  names  scores
가   가길동      90
나   나길동      56
다   다길동      87
라   라길동      78

In [34]:
#기존 컬럼에 값 설정하기
df2.major='컴퓨터공학'#스칼라(해당 컬럼의 모든행이 일괄 설정)
df2['major']='경영학'
df2

  names years  scores grade major
가   가길동   NaN      90     A   경영학
나   나길동   NaN      56     F   경영학
다   다길동   NaN      87     B   경영학
라   라길동   NaN      78     C   경영학

In [38]:
#각 행별로 각기 다른 값 설정시 튜플이나 리스트 혹은 시리즈 혹은 넘파이 배열
df2['major']='컴퓨터공학','경영학','토목공학','건축공학'
df2

  names years  scores grade  major
가   가길동   NaN      90     A  컴퓨터공학
나   나길동   NaN      56     F    경영학
다   다길동   NaN      87     B   토목공학
라   라길동   NaN      78     C   건축공학

In [42]:
#새로운 컬럼 생성 및 값 설정하기
#데이타프레임객체['새로운 컬럴명'] 형식으로 추가해야 한다
#df2.addr=['가산동','나산동','다산동','라산동'] df2.속성 형식으로 새로운 컬럼 추가 불가
df2['addr']=['가산동','나산동','다산동','라산동'] 
df2['ages']=np.random.randint(20,40,size=4)#넘파이 배열로 값 대입
df2

  names years  scores grade  major addr  ages
가   가길동   NaN      90     A  컴퓨터공학  가산동    23
나   나길동   NaN      56     F    경영학  나산동    37
다   다길동   NaN      87     B   토목공학  다산동    24
라   라길동   NaN      78     C   건축공학  라산동    29

In [45]:
series=pd.Series(data=['2021학번','2019학번'],index=['가','다'])

In [46]:
series.index

Index(['가', '다'], dtype='object')

In [48]:
'''
데이타프레임의 컬럼에 Series로 값 대입
기존의 행 index와 동일한 이름으로 시리즈의 index를 설정하면
데이타프레임의 행 인덱스에 맞춰서 시리즈 데이타가 설정된다
일치하지 않은 인덱스는 NaN
'''
df2['hakbun']=series
df2

  names years  scores grade  major addr  ages  hakbun
가   가길동   NaN      90     A  컴퓨터공학  가산동    23  2021학번
나   나길동   NaN      56     F    경영학  나산동    37     NaN
다   다길동   NaN      87     B   토목공학  다산동    24  2019학번
라   라길동   NaN      78     C   건축공학  라산동    29     NaN

In [50]:
df2['scores'] >= 80  #시리즈

가     True
나    False
다     True
라    False
Name: scores, dtype: bool

In [54]:
['합격' if i >=80 else '불합격' for i in df2['scores'] ]

['합격', '불합격', '합격', '불합격']

In [55]:
#pass컬럼 추가시 scores컬럼의 값에 따라 합격/불합격 설정
#즉 80점이상이면 합격,그렇지 않으면 불합격으로 값 설정
df2['pass']=['합격' if i >=80 else '불합격' for i in df2['scores'] ]
df2

  names years  scores grade  major addr  ages  hakbun pass
가   가길동   NaN      90     A  컴퓨터공학  가산동    23  2021학번   합격
나   나길동   NaN      56     F    경영학  나산동    37     NaN  불합격
다   다길동   NaN      87     B   토목공학  다산동    24  2019학번   합격
라   라길동   NaN      78     C   건축공학  라산동    29     NaN  불합격